app/views/parkings/show.html.erb

    <tbody>
      <% current_user.cars.each do |car| %>
---
SELECT "cars".* FROM "cars" WHERE "cars"."user_id" = $1  [["user_id", 6]]