app/controllers/users_controller.rb

  def index
    @q = User.ransack(params[:q])
    @users = @q.result(distinct: true).page(params[:page])
---
SELECT COUNT(DISTINCT "users"."id") FROM "users"
SELECT DISTINCT "users".* FROM "users" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]